app/Controllers/Home.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('fadhel', 'fadhel@gmail.com', 'qsdfg')
---
    public function insertion()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'name' => 'required|min_length[3]|is_unique[users.name]',
            'email'=> 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'password_confirm' => 'required|matches[password]',
        ]);

        // if (!$validation->withRequest($this->request)->run() {
        //     return redirect()->back()->withInput()->with('error', $validation->listErrors());
        // });

        $model = new UserModel();
        if ($this->request->getPost('password') == $this->request->getPost('repetepassword'))
        {
            $data = [
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'password' => $this->request->getPost('password')
            ];


            $model->insert($data);