app/Models/UserModel.php

    public function getUserByUsername($name)
    {
        return $this->where('name', $name)->first();
---
SELECT *
FROM `users`
WHERE `name` = 'nasaina'
 LIMIT 1